## Introduction to Pandas

#### **Name:** <insert name>

#### Import Libraries

In [1]:
import pandas as pd

In [3]:
import numpy as np

#### Create the dataset

In [4]:
data = {
    "Name": ["Alice", "Bob", np.nan, "David"],
    "Age": [25, np.nan, 30, 35],
    "Score": [85, 90, np.nan, 88],
}
df = pd.DataFrame(data)

#### Replace Age with mean

In [7]:
df.info()
df["Age"] = df["Age"].fillna(df["Age"].median())
df["Age"]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     4 non-null      float64
 2   Score   3 non-null      float64
dtypes: float64(2), object(1)
memory usage: 228.0+ bytes

0    25.0
1    30.0
2    30.0
3    35.0
Name: Age, dtype: float64

#### Replace Score

In [8]:
df["Score"] = df["Score"].fillna(round(df["Score"].mean()))
df["Score"]

0    85.0
1    90.0
2    88.0
3    88.0
Name: Score, dtype: float64

#### Rename Columns

In [9]:
df = df.rename(columns={"Name":"Student_Name", "Score":"Exam_Score"})
df

  Student_Name   Age  Exam_Score
0        Alice  25.0        85.0
1          Bob  30.0        90.0
2          NaN  30.0        88.0
3        David  35.0        88.0

#### Concatenate Dataframes

In [ ]:
df_concat_self_vert = pd.concat([df, df]) #concanate in vertical
df_concat_self_vert

  Class  Score  Age
0     A     85   15
1     B     90   16
2     A     88   15
3     B     72   17
4     C     95   16
5     C     80   15
0     A     85   15
1     B     90   16
2     A     88   15
3     B     72   17
4     C     95   16
5     C     80   15

In [ ]:
df_concat_self_hori = pd.concat([df, df], axis=1) #concanate in horizontal
df_concat_self_hori

  Class  Score  Age Class  Score  Age
0     A     85   15     A     85   15
1     B     90   16     B     90   16
2     A     88   15     A     88   15
3     B     72   17     B     72   17
4     C     95   16     C     95   16
5     C     80   15     C     80   15

#### Grouping Data by Categories

In [21]:
data = {
    "Class": ["A", "B", "A", "B", "C", "C"],
    "Score": [85, 90, 88, 72, 95, 80],
    "Age": [15, 16, 15, 17, 16, 15],
}
df2 = pd.DataFrame(data)

In [22]:
df2.groupby("Class").mean()

       Score   Age
Class
A       86.5  15.0
B       81.0  16.5
C       87.5  15.5